----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv3d-1       [-1, 45, 16, 56, 56]           6,615
       BatchNorm3d-2       [-1, 45, 16, 56, 56]              90
              ReLU-3       [-1, 45, 16, 56, 56]               0
            Conv3d-4       [-1, 64, 16, 56, 56]           8,640
       BatchNorm3d-5       [-1, 64, 16, 56, 56]             128
              ReLU-6       [-1, 64, 16, 56, 56]               0
            Conv3d-7      [-1, 144, 16, 56, 56]          82,944
       BatchNorm3d-8      [-1, 144, 16, 56, 56]             288
              ReLU-9      [-1, 144, 16, 56, 56]               0
           Conv3d-10       [-1, 64, 16, 56, 56]          27,648
      BatchNorm3d-11       [-1, 64, 16, 56, 56]             128
             ReLU-12       [-1, 64, 16, 56, 56]               0
           Conv3d-13      [-1, 144, 16, 56, 56]          82,944
      BatchNorm3d-14      [-1, 144, 16, 56, 56]             288
             ReLU-15      [-1, 144, 16, 56, 56]               0
           Conv3d-16       [-1, 64, 16, 56, 56]          27,648
      BatchNorm3d-17       [-1, 64, 16, 56, 56]             128
             ReLU-18       [-1, 64, 16, 56, 56]               0
       BasicBlock-19       [-1, 64, 16, 56, 56]               0
           Conv3d-20      [-1, 144, 16, 56, 56]          82,944
      BatchNorm3d-21      [-1, 144, 16, 56, 56]             288
             ReLU-22      [-1, 144, 16, 56, 56]               0
           Conv3d-23       [-1, 64, 16, 56, 56]          27,648
      BatchNorm3d-24       [-1, 64, 16, 56, 56]             128
             ReLU-25       [-1, 64, 16, 56, 56]               0
           Conv3d-26      [-1, 144, 16, 56, 56]          82,944
      BatchNorm3d-27      [-1, 144, 16, 56, 56]             288
             ReLU-28      [-1, 144, 16, 56, 56]               0
           Conv3d-29       [-1, 64, 16, 56, 56]          27,648
      BatchNorm3d-30       [-1, 64, 16, 56, 56]             128
             ReLU-31       [-1, 64, 16, 56, 56]               0
       BasicBlock-32       [-1, 64, 16, 56, 56]               0
           Conv3d-33      [-1, 230, 16, 28, 28]         132,480
      BatchNorm3d-34      [-1, 230, 16, 28, 28]             460
             ReLU-35      [-1, 230, 16, 28, 28]               0
           Conv3d-36       [-1, 128, 8, 28, 28]          88,320
      BatchNorm3d-37       [-1, 128, 8, 28, 28]             256
             ReLU-38       [-1, 128, 8, 28, 28]               0
           Conv3d-39       [-1, 230, 8, 28, 28]         264,960
      BatchNorm3d-40       [-1, 230, 8, 28, 28]             460
             ReLU-41       [-1, 230, 8, 28, 28]               0
           Conv3d-42       [-1, 128, 8, 28, 28]          88,320
      BatchNorm3d-43       [-1, 128, 8, 28, 28]             256
           Conv3d-44       [-1, 128, 8, 28, 28]           8,192
      BatchNorm3d-45       [-1, 128, 8, 28, 28]             256
             ReLU-46       [-1, 128, 8, 28, 28]               0
       BasicBlock-47       [-1, 128, 8, 28, 28]               0
           Conv3d-48       [-1, 288, 8, 28, 28]         331,776
      BatchNorm3d-49       [-1, 288, 8, 28, 28]             576
             ReLU-50       [-1, 288, 8, 28, 28]               0
           Conv3d-51       [-1, 128, 8, 28, 28]         110,592
      BatchNorm3d-52       [-1, 128, 8, 28, 28]             256
             ReLU-53       [-1, 128, 8, 28, 28]               0
           Conv3d-54       [-1, 288, 8, 28, 28]         331,776
      BatchNorm3d-55       [-1, 288, 8, 28, 28]             576
             ReLU-56       [-1, 288, 8, 28, 28]               0
           Conv3d-57       [-1, 128, 8, 28, 28]         110,592
      BatchNorm3d-58       [-1, 128, 8, 28, 28]             256
             ReLU-59       [-1, 128, 8, 28, 28]               0
       BasicBlock-60       [-1, 128, 8, 28, 28]               0
           Conv3d-61       [-1, 460, 8, 14, 14]         529,920
      BatchNorm3d-62       [-1, 460, 8, 14, 14]             920
             ReLU-63       [-1, 460, 8, 14, 14]               0
           Conv3d-64       [-1, 256, 4, 14, 14]         353,280
      BatchNorm3d-65       [-1, 256, 4, 14, 14]             512
             ReLU-66       [-1, 256, 4, 14, 14]               0
           Conv3d-67       [-1, 460, 4, 14, 14]       1,059,840
      BatchNorm3d-68       [-1, 460, 4, 14, 14]             920
             ReLU-69       [-1, 460, 4, 14, 14]               0
           Conv3d-70       [-1, 256, 4, 14, 14]         353,280
      BatchNorm3d-71       [-1, 256, 4, 14, 14]             512
           Conv3d-72       [-1, 256, 4, 14, 14]          32,768
      BatchNorm3d-73       [-1, 256, 4, 14, 14]             512
             ReLU-74       [-1, 256, 4, 14, 14]               0
       BasicBlock-75       [-1, 256, 4, 14, 14]               0
           Conv3d-76       [-1, 576, 4, 14, 14]       1,327,104
      BatchNorm3d-77       [-1, 576, 4, 14, 14]           1,152
             ReLU-78       [-1, 576, 4, 14, 14]               0
           Conv3d-79       [-1, 256, 4, 14, 14]         442,368
      BatchNorm3d-80       [-1, 256, 4, 14, 14]             512
             ReLU-81       [-1, 256, 4, 14, 14]               0
           Conv3d-82       [-1, 576, 4, 14, 14]       1,327,104
      BatchNorm3d-83       [-1, 576, 4, 14, 14]           1,152
             ReLU-84       [-1, 576, 4, 14, 14]               0
           Conv3d-85       [-1, 256, 4, 14, 14]         442,368
      BatchNorm3d-86       [-1, 256, 4, 14, 14]             512
             ReLU-87       [-1, 256, 4, 14, 14]               0
       BasicBlock-88       [-1, 256, 4, 14, 14]               0
           Conv3d-89         [-1, 921, 4, 7, 7]       2,121,984
      BatchNorm3d-90         [-1, 921, 4, 7, 7]           1,842
             ReLU-91         [-1, 921, 4, 7, 7]               0
           Conv3d-92         [-1, 512, 2, 7, 7]       1,414,656
      BatchNorm3d-93         [-1, 512, 2, 7, 7]           1,024
             ReLU-94         [-1, 512, 2, 7, 7]               0
           Conv3d-95         [-1, 921, 2, 7, 7]       4,243,968
      BatchNorm3d-96         [-1, 921, 2, 7, 7]           1,842
             ReLU-97         [-1, 921, 2, 7, 7]               0
           Conv3d-98         [-1, 512, 2, 7, 7]       1,414,656
      BatchNorm3d-99         [-1, 512, 2, 7, 7]           1,024
          Conv3d-100         [-1, 512, 2, 7, 7]         131,072
     BatchNorm3d-101         [-1, 512, 2, 7, 7]           1,024
            ReLU-102         [-1, 512, 2, 7, 7]               0
      BasicBlock-103         [-1, 512, 2, 7, 7]               0
          Conv3d-104        [-1, 1152, 2, 7, 7]       5,308,416
     BatchNorm3d-105        [-1, 1152, 2, 7, 7]           2,304
            ReLU-106        [-1, 1152, 2, 7, 7]               0
          Conv3d-107         [-1, 512, 2, 7, 7]       1,769,472
     BatchNorm3d-108         [-1, 512, 2, 7, 7]           1,024
            ReLU-109         [-1, 512, 2, 7, 7]               0
          Conv3d-110        [-1, 1152, 2, 7, 7]       5,308,416
     BatchNorm3d-111        [-1, 1152, 2, 7, 7]           2,304
            ReLU-112        [-1, 1152, 2, 7, 7]               0
          Conv3d-113         [-1, 512, 2, 7, 7]       1,769,472
     BatchNorm3d-114         [-1, 512, 2, 7, 7]           1,024
            ReLU-115         [-1, 512, 2, 7, 7]               0
      BasicBlock-116         [-1, 512, 2, 7, 7]               0
================================================================
Total params: 31,300,125
Trainable params: 31,300,125
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 2.30
Forward/backward pass size (MB): 1496.85
Params size (MB): 119.40
Estimated Total Size (MB): 1618.54
----------------------------------------------------------------